{
    "Education": 
    [
        {"school": "Concordia University (2015-2019)", "degree": "Software Engineering with Co-op", "body":"I graduated from Concordia University with distinction in May of 2019. I was on deans list every year of my academic career here and received a total of three scholarships. This degree gave me the necessary skills in order to tackle OOP and software design. I have accomplished a number of projects that took me through the entire life cycle of shipping a product."},
        {"school": "Vanier College (2013-2015)", "degree": "Pure & Applied Sciences", "body": "My time at Vanier is when I understood my love for applied sciences. I enjoyed my math, and physics courses. In my last year I took an intro to web development class that lead me to find out that my true passion existed in technology!"}          
    ],

    "Experience":
    [
        {"company": "AppDirect", "time":"January 2022 - Current", "position": "Senior Microsoft Integrations Software Developer", "body":"Led the development of many high revenue generating features. High focus on technical design and devlivering clean, user friendly code, while mentoring juniors and spreading the joy of efficient coding! I am heavily involved in cross team features, and have a proven track record of solutioning with such people to come up with solutions that are accepted in a multi-team situation. Primarily use Java Spring boot on day to day while developing in many microservices using tools like kafka, docker, and kubernetes."},
        {"company": "AppDirect", "time":"January 2021 - January 2022", "position": "Microsoft Integrations Software Developer", "body":"Developped features and solved issues for all things Microsoft for AppDirect's selling platform. On a bi-weekly term, I act as lead support engineer to investigate and fix urgent client issues. I am very involved in the scrum process and act as the Scrum Master to ensure the sprint is on track. I mainly use Java here and work heavily with microservices."},
        {"company": "Genetec", "time":"May 2019 - December 2020", "position": "Software Developer", "body":"Contributing to Genetec's ever growing security software. I primarily use C# here to implement features for clients and fix bugs as I go. I am also very much involved in ameliorating our software cycle by implementing new processes in order to make the team more efficient."},
        {"company": "AppHelp", "time":"May 2018- May 2019", "position": "Full Stack Web Developer Intern", "body":"Developed core features to ticketing web app, using primarily C# and ReactJS, that is the primary product of the Montreal location. I was one of the two people who transformed this application to new a stack, seeing the product from start to finish."},
        {"company": "Vigilant, A DRW Company", "time": "May 2017 - August 2017", "position": "Web Developer Intern", "body": "Developed an application using primarily: C#, ReactJS, .NET Core and Google Maps API that went on to be used by the company founder for trading purposes. I took on sole contribution to this project, which allowed me to be apart of the full development cycle from requirements elicitation to deployment."},
        {"company": "Vigilant, A DRW Company", "time": "September 2016 - December 2016", "position": "Web Developer Intern", "body": "Developed two applications from scratch for HR purposes, using C#, ReactJS, .NET Core and Nodejs. Provided support for bug fixing across multiple applications."}
    ],

    "Skills": [
        {"type": "Languages & Frameworks", "skills": [{"name":"JavaScript", "percent": 90}, {"name":"C#", "percent": 85}, {"name":"Java", "percent": 80}, {"name":"Python", "percent": 60}, {"name":"NodeJs", "percent":70}, {"name":"React", "percent": 90}, {"name":"Redux", "percent": 88},  {"name":"SQL", "percent":75}, {"name":"Kafka"}, {"name": "Docker"}, {"name": "Kubernetes"}, {"name":".NET & .NET core", "percent": 75}, {"name":"Jest", "percent":55}, {"name":"MSTest", "percent": 70}]},
        {"type": "Tools", "skills": [{"name": "Visual Studio", "percent":88}, {"name":"GitHub", "percent": 90}, {"name":"Git", "percent":90}, {"name":"MySQL", "percent":80},{"name":"MongoDB", "percent":85}, {"name":"Eclipse", "percent":70}, {"name":"JetBrains IDEs","percent":70}, {"name":"JIRA", "percent":70}, {"name":"Microsoft Office Apps", "percent":90}]}
    ],

    "Projects": [
        {"name": "Document Generator", "stakeholder":"Genetec", "timeFrame":"September 2018 - April 2019", "description": "This project was done for capstone - a final year project for engineering. This app processes SDKs and XMLs to extract C# triple slashes in the code. The extracted information is displayed in the corresponding sections, i.e as classes, interfaces, etc. I was a strong contributor in both backend and frontend aspects, and advocated agile processes such as sprint planning. I was hired as a full-time developer during the development of this project. Technology Applied: C#, ReactJS, Redux, MongoDB."},
        {"name": "AnyMemo", "stakeholder":"Concordia University", "timeFrame": "January 2018 - May 2018", "description": "This project was entailed developping additional features to the open source AnyMemo flashcard application. I added core features including: favourites deck, hint mode and history deck. Technology Applied: Java, Android SDK tools."},
        {"name": "Apollo Store", "stakeholder": "Concordia University", "timeFrame":"September 2017 - December 2017", "description": "This project is an online electronics store with two types of users: clients and admins. Clients can browse inventory and buy electronics. Admins can add/delete/update the inventory. I developed the database schemas to ensure there was consistencies, implemented the data mapper design pattern and developed important user features. Technology Applied: Python, Flask, HTML, Bootstrap, MySQL."}  
    ]
}
